БылковДА_70180166/src/Catalogs/Семестры/Семестры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Семестры</name>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
</mdclass:Catalog>

БылковДА_70180166/src/Catalogs/Студенты/Студенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Студенты</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ЛичныйИндекс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтуденческийБилет</name>
    <type>
      <types>CatalogRef.СтуденческиеБилеты</types>
    </type>
  </attributes>
  <attributes>
    <name>Факультет</name>
    <type>
      <types>CatalogRef.Факультеты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправленияПодготовки</name>
    <type>
      <types>CatalogRef.НаправленияПодготовки</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>EnumRef.ФормаОбучения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидФинансирования</name>
    <type>
      <types>EnumRef.ВидыФинансирования</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРасмотрения</name>
    <type>
      <types>EnumRef.СтатусРассмотрения</types>
    </type>
  </attributes>
</mdclass:Catalog>

БылковДА_70180166/src/Catalogs/Семестры/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура СтудентПриИзменении(Элемент)
    Если ЗначениеЗаполнено(Объект.Студент) Тогда
        СеместрСтудента = ПолучитьСеместрСтудентаНаСервере(Объект.Студент);
        Объект.Семестр = СеместрСтудента;
    Иначе
        Объект.Факультет = Неопределено;
    КонецЕсли;
КонецПроцедуры        

&НаСервере
Функция ПолучитьСеместрСтудентаНаСервере(СсылкаНаСтудента)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    Студенты.Семестр КАК Семестр
    |ИЗ
    |    Справочник.Студенты КАК Студенты
    |ГДЕ
    |    Студенты.Ссылка = &СсылкаНаСтудента";
    
    Запрос.УстановитьПараметр("СсылкаНаСтудента", СсылкаНаСтудента);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Семестр;
    КонецЕсли;
    
    Возврат Неопределено;
КонецФункции
